init:
    $ za = Character(u"Зарянка", color = "#F00")
    $ ba = Character(u"Пожилая женщина", color = "#F00")
    $ li = Character(u"Лихнецкий", color = "#F00")
label start:
    scene first with Dissolve(.25):
        xpos 0
        ease 25 xpos -3840

    "Добро пожаловать в Звездный городок!"
    "Звездный городок - это место, откуда совершались все космические подвиги нашей страны!"
    "Именно здесь была оборудована и снабжена первая Совето-Американская экспедиция на марс."
    "Это было колоссальным достижением как для нашего Звездного городка, так и для всей советской науки!"
    "После этого неспеша началась подготовка ко второй марсианской экспедиции."
    "Пока кто-то не выдумал дурацкий лозунг \"Марс - дело общее\", облетевший за неделю весь интернет, еще и получив склеенный кем-то ролик."
    "Вообщем резонанс в обществе пошел как по маслу, и Верховным Советом в экспедицию было выделено два места для простых людей."
    scene first:
        xpos -3840
        ease 10 xpos -5760
    "Тоесть каждый мог предоставить свою кандидатуру, с двумя лишь условиями:{w} отменное здоровье и собственная исследовательская программа."
    "Для этого и была открыта приемная комиссия, где сидел Сергей Лихнецкий."
    scene first:
        xalign .91 yalign 0.45
        xanchor .98 yanchor .45
        linear 3 zoom 1.8
    $ renpy.pause(3)
    scene lobby with Fade(0.3, 0.2, 1, color="#fff")
    $ renpy.pause(.5)
    "Прошлым кандидатом Лихнецкого был длинноволосый поэт, единственным желание которого было найти на Марсе свою музу, документы которого естественно не приняли."
    "Следующим кандидатом была..."
    "*Стук в дверь*"
    li "Входите."
    show za smile with Dissolve(1)
    "... пожилая женщина.{w} Кудрявые седые, как снег, волосы, мягкое лицо, прочерченное морщинами, яркие голубые глаза, похожие на летнее небо, и популярный среди добровольцев синий комбинезон на лямках. "
    ba "Здравствуйте."
    li "Добрый день. Добро пожаловать в звездный городок.{w} Меня зовут Лихнецкий Сергей. Могу я увидеть ваши документы?"
    ba "Здравствуйте, Сергей, вот, пожалуйста."
    #Что-то типа интерфейса Лихнецкого
    "Голос гостьи оказался на удивление мелодичный. И вся она производила успокаивающее впечатление. Такой Сергей мог представить бабушку. Не свою, а среднестатистическую, пекущую блины и пирожки, подкармливающую голубей в парке, к которой ездят внуки на каникулы. Что она делает здесь? Что ей нужно в космосе?"
    "*Звук бумаг*"
    $ renpy.pause(.5)
    "Изучив бумаги Лихнецкий был удивлен состоянием здоровья Бабушки.{w} Но полет в космос это даже не недельный турпоход, тут пожилым людям делать нечего.\nЭто уже веская причина для отказа."
    "Но воспитанность члена комиссии не давала ему сразу отказать такой милой пожилой женщине."
    "*Звук бумаг*"
    $ renpy.pause(.5)
    "При дальнейшем осмотре бумаг Лихнецким была обнаружена отличная исследовательская программа: немного биологии, немного астрономии, немного физики."
    "И самое поразительное, что упор в ней делался не на исследования, а на трансляцию научной программы для школьников!{w} Программа получалась полезной и увлекательной."
    "Идеальный кандидат на одно из мест, команда бы ей обрадовалась..."
    "Но увы,{w} возраст."
    li "Екатерина Ивановна, я посмотрел ваши документы. У вас чудесная научная программа. Действительно интересно."
    ba "Спасибо"
    "От улыбки, вокруг её глаз побежали морщинки."
    ba "Несколько моих знакомых педагогов удалось уговорить помочь в её составлении. Если у вас будут замечания, мы их быстро устраним."
    li "Да нет, замечаний не будет. Мы не корректируем программы кандидатов. Только в случае попадания в экипаж могут вноситься корректировки для совмещения графика с остальным экипажем."
    #Типа погруснела
    li "Проблема в другом."
    "Сергей потер переносицу, подбирая слова, чтобы не обидеть собеседницу."
    li "При всех наших технических возможностях, экспедиция на Марс остается очень сложным и дорогостоящим предприятием. Ограничения в тоннаже отправляемых на орбиту грузов лимитируют нас  в оборудовании..."
    "Лихнецкий пытался засыпать её словами, для того чтобы отказ не прозвучал слишком резко.{w} Ведь ему была приятна эта пожилая женщина и он ни в коем случае не хотел обидеть её."
    "Увы, но экспедиция в течение всех месяцев полета должна будет обходиться минимумом медицинского оборудования. Только самое необходимое, рассчитанное на возможные несчастные случаи. Помните вторую американскую? С такими авариями мы справимся. Есть даже реанимационный блок и возможность провести экстренную операцию."
    #нахмуренно-удивленное выражение
    "Женщина удивленно смотрела на него, не понимая, зачем он ей это рассказывает."
    li "Но мы не можем обеспечить длительного лечения и проведения процедур."
    "Сергей невольно отвел от неё взгляд."
    li "Тем более, постоянного плотного контроля в процессе высадки экспедиции.{w} Размер экипажа ограничен, и выделение отдельного врача для контроля здоровья во время непосредственной работы на Марсе для нас непозволительная роскошь." 
    #Еще болшее удивление
    ba "Но ведь у меня же все хорошо со здоровьем."
    "Сказала она опустив глаза."
    ba "Вы хотите сказать, что я слишком старая, чтобы лететь в космос?"
    "Её голос сильнее приобретал обреченный оттенок."
    ba "Так?{w} Но ведь у вас нет ограничения по возрасту."
    "Она снова оживилась."
    # Надежда в глазах
    ba "Нигде не указан предельный возраст для кандидатов.{w} Я специально смотрела."
    li "Да, конечно, предельного возраста нет.{w} Мы опираемся на разумную оценку здоровья и возможностей кандидата."
    "Эти слова, похоже, окончательно добили старушку."
    ba "Но у меня все в порядке с этим. К тому же на орбитальную станцию летали люди старше меня. Я смотрела в сети, все было хорошо, никаких ограничений для них не было."
    "Женщина решила идти ва-банком."
    li "Я помню эти случаи. Но, фактически, это были туристы. С кратким пребыванием на орбитальной. Никаких долгих полетов, ограниченные нагрузки. А с Земли их постоянно вели врачи."
    "Сергей с сожалением развел руками."
    li "Но ведь это не наш случай.{w} Почти два года в космосе — это не шутка!"
    li "Случись что — необходимого лечения экипаж обеспечить не сможет.{w} Упомянутые вами туристы по возвращении на Землю, проходили курс реабилитации. А миссии предстоит высадка на поверхность, затем взлет."
    # Погруснения
    li "Серьезные перегрузки после длительной невесомости.{w} Даже если вы останетесь в орбитальном модуле — кто даст гарантии, что экипажу не придется прерывать программу для помощи вам? "
    
    
    
    
    
    
    
    
    
    
    
  
    
    
    
    
    